# PathCurveCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..PathCurveCount Property
Form Class See Also
---
The number of curves in the form path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int PathCurveCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathCurveCount As Integer
	Get
```

Visual C++
---
```text
public:
property int PathCurveCount {
	int get ();
}
```

# See Also
Form Class
Autodesk.Revit.DB Namespace